<?php

// $a = array('th'=>"thailand",'jp'=>"japan",'kr'=>"Korea");
   
// //ใช้ลูป while เพื่อให้เลื่อนพอยน์เตอร์ไปเรื่อยๆ จนกว่าจะคืนค่า false
// while(list($key,$value) = each($a)){
  
//   echo "$key => $value <br/>";
   
// }

// $sum = 0;
// echo "Sum of 1 -";
// for($i =1; $i <= 10; $i++){
//     $sum += $i;
//     if($sum >=30){
//         $x = $i;
//         echo $x. " = " . $sum;
//         exit;
//     }
// }
function ceil_num_01(){
  echo "<span> จำนวนเต็มที่อยู่ถัดไปจากจำนวนที่ระบุ  10.01  = </span>".ceil(10.01)."<br>";
  echo "<span> จำนวนเต็มที่อยู่ถัดไปจากจำนวนที่ระบุ  10.50  = </span>". ceil(10.50)."<br>";
  echo "<span> จำนวนเต็มที่อยู่ก่อนจำนวนที่ระบุ 1.01  = </span>". floor(1.01)."<br>";
  echo "<span> จำนวนเต็มที่อยู่ก่อนจำนวนที่ระบุ -1.01  = </span>". floor(-1.01)."<br>";
  echo "<span> round(จำนวน,[ทศนิยม]) ใช้ในการประมาณค่าเป็นจำนวนเต็มที่ไกล้เคียง หากเศษน้อยกว่า 0.5 จะตัดทิ้ง แต่หากเศษมีค่าตั้งแต่ 0.5 จะปัดไปเป็นจำนวนเต็ฒถัดไป 10.49 = </span>"
        . round(10.49)."<br>";
  echo "<span> intval(จำนวน) เลือกเอาเฉพาะจำนวนเต็มของจำนวนที่ระบุ หากมีทศนิยมจะตัดทิ้ง 10.99 = </span>"
        .intval(10.99)."<br>";
  echo "<span> floatval(จำนวน) เลือกเอาจำนวนที่ระบุในแบบ float ซึ่งฟังค์ชั่นนี้น่าจะมีประโยชน์ในกรณีที่จำนวนนั้นวางอยู๋ข้างหน้าสตริง 12.34 MB = </span>"
        .floatval("12.34 mb")."<br>";
}
function Compare(){
  echo "<h3> ฟังก์ชั่นในการเปรียบเทียบจำนวน </h3><br/>";
  echo "<span> min(6,7,3,8,9) หรือ min(array) หาค่าที่น้อยที่สุดในระหว่างจำนวนที่กำหนด ( 6,7,3,8,9 ) = </span> ".min(6,7,3,8,9)."<br/>"
       ."<span>  min(array)  10,10.5,3.4,5.2,20 = </span>".min(array(10,10.5,3.4,5.2,20))."<br/>";
  echo "<span> max(6,7,3,8,9) หรือ max(array) หาค่าที่มากที่สุดในระหว่างจำนวนที่กำหนด ( 6,7,3,8,9 ) = </span> ".max(6,7,3,8,9)."<br/>"
       ."<span>  max(array)  10,10.5,3.4,5.2,20 = </span>".max(array(10,10.5,3.4,5.2,20));
}
function Formatting_numbers(){
  $a = is_numeric(123);
  $b = is_numeric("1.23");
  $c = is_numeric("123abc");
  echo "<h3> ฟังก์ชั่นการตรวจสอบและจัดรูปแบบตัวเลข </h3><br/>";
  echo "<span> number_format(จำนวน) ใช้ในการจัดรูปแบบตัวเลข จาก 1234 เป็น 1,234 = </span> ".number_format(1234567)."<br/>"
  ."<span>  is_numeric(ข้อมูล) ตรวจสอบว่าข้อมูลที่ระบุนั้นเป็นตัวเลขหรือไม่ โดยจะคืนค่า true ถ้าเป็นข้อมูลแบบตัวเลข ที่ไม่มีอักขระอื่นๆ ปะปนอยู่ด้วย ทั้งนี้ตัวเลขที่เขียนในแบบสตริง เช่น '123' ก็ถือว่าเป็นตัวเลขด้วย </span><br>"
  ."<span> is_numeric(123) = 1 = true = </span>".$a."<br/>"
  ."<span> is_numeric('1.23') = 1 = true = </span>".$b."<br/>"
  ."<span> is_numeric('123abc') = ค่าว่าง = false = </span>".$c."<br/>";
}

function  Additional_functions () {
      echo "<h3>ฟังค์ชั่นเพิ่มเติมอื่นๆ</h3>";
      $x = abs(10);
      $y = abs(-10);
      $r1 = rand();
      $r2 = rand(10,20);
      echo "<span> function abs(จำนวน) ใช้สำหรับหาค่า absolute เช่น abs(10) , abs(-10) = </span>" . $x . "," . $y . "<br>";
      echo "<span> function rand() หรือ rand(ค่าน้อยที่สุด,ค่ามากที่สุด) ใช้ในการสร้างเลขสุ่ม โดยค่าที่ได้จะไม่แน่นอนในแต่ล่ะครั้ง ซึ้งโดยปกติแล้วเลขสุ่มที่ได้จะเป็นเลขจำนวนเต็มที่มีค่าระหว่าง 0-32,768 แต่อย่างไรก็ตาม PHP อณุญาติให้เราสามารถกำหนดช่วงตัวเลขผลลัพธ์ที่ต้องการได้ว่าให้อยู่ระหว่างค่าไดถึงค่าใด </span><br/>"
            ."<span> เช่น rand() เลขสุ่มที่ได้จะมีค่าระหหว่าง 0 - 32,768  = </span>" . $r1 . "<br/>"
            ."<span> rand(10,20) เลขที่สุ่มได้จะมีค่าระหว่าง 10 - 20 = </span>" . $r2 . "<br/>";
      
      echo "<span> function mt_rand() หรือ mt_rand(ค่าน้อยที่สุด,ค่ามากที่สุด) ใช้ในการสร้างเลขสุ่ม โดยค่าที่ได้จะไม่แน่นอนในแต่ล่ะครั้ง ซึ้งโดยปกติแล้วเลขสุ่มที่ได้จะเป็นเลขจำนวนเต็มที่มีค่าระหว่าง 0-32,768 แต่อย่างไรก็ตาม PHP อณุญาติให้เราสามารถกำหนดช่วงตัวเลขผลลัพธ์ที่ต้องการได้ว่าให้อยู่ระหว่างค่าไดถึงค่าใด </span><br/>"
                  ."<span> เช่น rand() เลขสุ่มที่ได้จะมีค่าระหหว่าง 0 - 32,768  = </span>" . $r1 . "<br/>"
                  ."<span> rand(10,20) เลขที่สุ่มได้จะมีค่าระหว่าง 10 - 20 = </span>" . $r2 . "<br/>";
      
}

ceil_num_01();
Compare();
Formatting_numbers();
Additional_functions();








